js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
static HAL_StatusTypeDef poll_flag(uint32_t mask, uint32_t deadline)
{
   for (;;) {
      const uint32_t sr = QUADSPI->SR;
      if (sr & mask)
         return HAL_OK;
      if (sr & QUADSPI_SR_TEF) {
         qspi_abort();
         return HAL_ERROR;
      }
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
}

static HAL_StatusTypeDef wait_read_data(uint32_t mask, uint32_t deadline)
{
   for (;;) {
      const uint32_t sr = QUADSPI->SR;
      if (sr & mask)
         return HAL_OK;
      if (sr & QUADSPI_SR_TEF) {
         qspi_abort();
         return HAL_ERROR;
      }
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
}

static HAL_StatusTypeDef read_dr_byte(uint32_t deadline, uint8_t *byte_out,
                                      uint32_t *wait_iters)
{
   for (;;) {
      const uint32_t sr = QUADSPI->SR;
      if (sr & QUADSPI_SR_FLEVEL) {
         *byte_out = *(volatile uint8_t *)&QUADSPI->DR;
         return HAL_OK;
      }
      if (wait_iters != NULL)
         (*wait_iters)++;
      if (sr & QUADSPI_SR_TEF) {
         qspi_abort();
         return HAL_ERROR;
      }
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
}

HAL_StatusTypeDef qspi_xfer(const qspi_cmd_t *cmd, qspi_fmode_t fmode,
                            void *buf, uint32_t timeout_ms)
{
   if (!initialised || cmd == NULL)
      return HAL_ERROR;
   if (cmd->data_len && buf == NULL && fmode != QSPI_FMODE_AUTOPOLL)
      return HAL_ERROR;
   if (cmd->addr_bytes > 4U || cmd->alt_bytes_len > 4U ||
       cmd->dummy_cycles > 31U)
      return HAL_ERROR;

   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   HAL_StatusTypeDef s = wait_not_busy(deadline);
   if (s != HAL_OK)
      return s;

   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   QUADSPI->DLR = cmd->data_len ? (cmd->data_len - 1U) : 0U;
   QUADSPI->ABR = cmd->alt_bytes;
   QUADSPI->CCR = build_ccr(cmd, fmode);
   if (cmd->addr_lines != QSPI_LINES_NONE)
      QUADSPI->AR = cmd->address;

   uint8_t qdr_bytes[16];
   uint32_t qdr_count = 0U;
   if (cmd->data_len) {
      volatile uint8_t  *const dr8  = (volatile uint8_t  *)&QUADSPI->DR;
      volatile uint32_t *const dr32 = (volatile uint32_t *)&QUADSPI->DR;
      uint8_t *bp                   = (uint8_t *)buf;
      uint32_t remaining            = cmd->data_len;
      const bool qdr_diag =
         (fmode == QSPI_FMODE_READ && cmd->data_lines == QSPI_LINES_4 &&
          (cmd->instruction == 0x6BU || cmd->instruction == 0x6DU));
      if (fmode == QSPI_FMODE_READ && cmd->data_lines == QSPI_LINES_4) {
         while (remaining) {
            uint8_t b;
            s = read_dr_byte(deadline, &b, NULL);
            if (s != HAL_OK)
               return s;
            *bp++ = b;
            if (qdr_diag && qdr_count < sizeof(qdr_bytes))
               qdr_bytes[qdr_count++] = b;
            remaining--;
         }
      } else if (fmode == QSPI_FMODE_READ) {
         while (remaining >= 4U) {
            s = wait_read_data(QUADSPI_SR_FTF | QUADSPI_SR_TCF, deadline);
            if (s != HAL_OK)
               return s;
            const uint32_t w = *dr32;
            bp[0] = (uint8_t)(w >> 0);
            bp[1] = (uint8_t)(w >> 8);
            bp[2] = (uint8_t)(w >> 16);
            bp[3] = (uint8_t)(w >> 24);
            if (qdr_diag) {
               for (uint32_t i = 0; i < 4U && qdr_count < sizeof(qdr_bytes);
                    i++)
                  qdr_bytes[qdr_count++] = bp[i];
            }
            bp += 4;
            remaining -= 4U;
         }
         if (remaining) {
            s = wait_read_data(QUADSPI_SR_TCF, deadline);
            if (s != HAL_OK)
               return s;
            const uint32_t w = *dr32;
            for (uint32_t i = 0; i < remaining; i++) {
               bp[i] = (uint8_t)(w >> (8U * i));
               if (qdr_diag && qdr_count < sizeof(qdr_bytes))
                  qdr_bytes[qdr_count++] = bp[i];
            }
            remaining = 0U;
         }
      } else {
         while (remaining) {
            s = poll_flag(QUADSPI_SR_FTF, deadline);
            if (s != HAL_OK)
               return s;
            *dr8 = *bp++;
            remaining--;
         }
      }
   }

   s = poll_flag(QUADSPI_SR_TCF, deadline);
   if (s != HAL_OK)
      return s;
   QUADSPI->FCR = QUADSPI_FCR_CTCF;

   s = wait_not_busy(deadline);
   if (s != HAL_OK)
      return s;

   if (qdr_count) {
      my_printf("qdr%02x", (unsigned)cmd->instruction);
      for (uint32_t i = 0; i < qdr_count; i++)
         my_printf(" %02x", (unsigned)qdr_bytes[i]);
      my_printf("\r\n");
   }

   return HAL_OK;
}

HAL_StatusTypeDef qspi_mm_enable(const qspi_cmd_t *cmd)
{
   if (!initialised || cmd == NULL)
      return HAL_ERROR;

   const uint32_t deadline = HAL_GetTick() + 100U;
   HAL_StatusTypeDef s     = wait_not_busy(deadline);
   if (s != HAL_OK)
      return s;

   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   QUADSPI->ABR = cmd->alt_bytes;
   QUADSPI->CCR = build_ccr(cmd, QSPI_FMODE_MEMMAPPED);
   return HAL_OK;
}

void qspi_mm_disable(void)
{
   /* qspi_abort() is unconditional and resets FIFO + deasserts CS,
    * which is what mem-mapped tear-down also needs. */
   qspi_abort();
}

HAL_StatusTypeDef qspi_autopoll(const qspi_cmd_t *cmd, uint32_t mask,
                                uint32_t match, uint32_t interval_cycles,
                                uint32_t timeout_ms)
{
   if (!initialised || cmd == NULL)
      return HAL_ERROR;

   const uint32_t deadline = HAL_GetTick() + timeout_ms;
   HAL_StatusTypeDef s     = wait_not_busy(deadline);
   if (s != HAL_OK)
      return s;

   /* AND-match (PMM=0), automatic stop on match (APMS=1). */
   uint32_t cr = QUADSPI->CR;
   cr &= ~QUADSPI_CR_PMM;
   cr |= QUADSPI_CR_APMS;
   QUADSPI->CR = cr;

