js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
   QUADSPI->FCR   = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   QUADSPI->PSMKR = mask;
   QUADSPI->PSMAR = match;
   QUADSPI->PIR   = interval_cycles & 0xFFFFU;
   QUADSPI->DLR   = cmd->data_len ? (cmd->data_len - 1U) : 0U;
   QUADSPI->ABR   = cmd->alt_bytes;
   QUADSPI->CCR   = build_ccr(cmd, QSPI_FMODE_AUTOPOLL);
   if (cmd->addr_lines != QSPI_LINES_NONE)
      QUADSPI->AR = cmd->address;

   while (!(QUADSPI->SR & QUADSPI_SR_SMF)) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
      if (QUADSPI->SR & QUADSPI_SR_TEF) {
         qspi_abort();
         return HAL_ERROR;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CSMF;
   /* APMS=1 auto-clears the transfer; just be safe. */
   qspi_abort();
   return HAL_OK;
}

HAL_StatusTypeDef qspi_bench_read(uint8_t opcode, qspi_lines_t data_lines,
                                  uint8_t dummy_cycles, uint32_t len,
                                  bool raw,
                                  uint32_t *crc_out, uint32_t *first_err_out,
                                  uint8_t  *got16_out,
                                  uint32_t *elapsed_ms_out)
{
   if (!initialised || len == 0)
      return HAL_ERROR;

   my_printf("BENCHDBG poll_enter t=%lu opcode=%02x lines=%u dummy=%u "
             "len=%lu\r\n",
             (unsigned long)HAL_GetTick(), (unsigned)opcode,
             (unsigned)data_lines, (unsigned)dummy_cycles,
             (unsigned long)len);

   const uint32_t deadline = HAL_GetTick() + 600000U;
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   QUADSPI->DLR = len - 1U;
   QUADSPI->ABR = 0;

   uint32_t ccr = 0;
   if (!raw) {
      ccr |= ((uint32_t)opcode) << CCR_INSTRUCTION_Pos;
      ccr |= 1U << CCR_IMODE_Pos;         /* opcode 1-lane */
      ccr |= 1U << CCR_ADMODE_Pos;        /* address 1-lane */
      ccr |= (3U - 1U) << CCR_ADSIZE_Pos; /* 3-byte address */
   }
   /* raw=true -> IMODE=0 + ADMODE=0: data phase only on the wire. */
   ccr |= lines_to_mode(data_lines) << CCR_DMODE_Pos;
   ccr |= (uint32_t)(dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)QSPI_FMODE_READ) << CCR_FMODE_Pos;
   QUADSPI->CCR = ccr;
   if (!raw)
      QUADSPI->AR = 0U;

   uint32_t crc                  = 0xFFFFFFFFUL;
   uint32_t first_err            = 0xFFFFFFFFUL;
   uint8_t  got16[16]            = {0};
   const uint32_t t0             = HAL_GetTick();
   uint32_t wait_iters           = 0;

   uint32_t i = 0;

   if (data_lines == QSPI_LINES_4) {
      while (i < len) {
         uint8_t b;
         HAL_StatusTypeDef s = read_dr_byte(deadline, &b, &wait_iters);
         if (s != HAL_OK)
            return s;
         bench_consume_byte(b, i, &crc, &first_err, got16);
         i++;
      }
   } else {
      volatile uint32_t *const dr32 = (volatile uint32_t *)&QUADSPI->DR;

      while (i + 4U <= len) {
         while (!(QUADSPI->SR & (QUADSPI_SR_FTF | QUADSPI_SR_TCF))) {
            wait_iters++;
            if (QUADSPI->SR & QUADSPI_SR_TEF) {
               qspi_abort();
               return HAL_ERROR;
            }
            if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
               qspi_abort();
               return HAL_TIMEOUT;
            }
         }
         const uint32_t w = *dr32;
         for (uint32_t j = 0; j < 4U; j++) {
            bench_consume_byte((uint8_t)(w >> (8U * j)), i, &crc,
                               &first_err, got16);
            i++;
         }
      }

      if (i < len) {
         while (!(QUADSPI->SR & QUADSPI_SR_TCF)) {
            wait_iters++;
            if (QUADSPI->SR & QUADSPI_SR_TEF) {
               qspi_abort();
               return HAL_ERROR;
            }
            if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
               qspi_abort();
               return HAL_TIMEOUT;
            }
         }
         const uint32_t w = *dr32;
         for (uint32_t j = 0; i < len; j++, i++)
            bench_consume_byte((uint8_t)(w >> (8U * j)), i, &crc,
                               &first_err, got16);
      }
   }

   while (!(QUADSPI->SR & QUADSPI_SR_TCF)) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTCF;
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }

   *crc_out        = crc ^ 0xFFFFFFFFUL;
   *first_err_out  = first_err;
   for (int k = 0; k < 16; k++)
      got16_out[k] = got16[k];
   *elapsed_ms_out = HAL_GetTick() - t0;
   (void)wait_iters;
   my_printf("BENCHDBG poll_done t=%lu len=%lu firsterr=%ld\r\n",
             (unsigned long)HAL_GetTick(), (unsigned long)len,
             (first_err == 0xFFFFFFFFUL) ? -1L : (long)first_err);
   return HAL_OK;
}

/* MDMA channel 0 streaming read into DDR.  Direct register programming
 * (HAL not used) so we can pin TSEL = 0x1A (QUADSPI FIFO threshold) per
 * RM0475.  The destination must be 4-byte aligned and lie in DDR. */
HAL_StatusTypeDef qspi_mdma_start(uint8_t opcode, qspi_lines_t data_lines,
                                  uint8_t dummy_cycles, uint32_t len,
                                  bool raw, uint32_t dst_addr,
                                  uint32_t timeout_ms, bool clean_before)
{
   if (!initialised || len == 0U)
      return HAL_ERROR;
   if (dst_addr & 0x3U)
      return HAL_ERROR;
   if (mdma_active)
      return HAL_BUSY;

   /* Enable MDMA AHB6 clock.  Idempotent. */
   __HAL_RCC_MDMA_CLK_ENABLE();

   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   /* Drain any prior QSPI state. */
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   uint32_t cr = QUADSPI->CR;
   cr &= ~QUADSPI_CR_FTHRES_Msk;
   cr |= ((data_lines == QSPI_LINES_4 ? 3U : 15U)
          << QUADSPI_CR_FTHRES_Pos);
   QUADSPI->CR = cr;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;

   /* Disable channel and clear any pending flags. */
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   /* Clean+invalidate the destination cache range when requested so:
    *  (a) any dirty lines won't get written back over MDMA data, and
    *  (b) a subsequent CPU read picks up the fresh DDR contents.
    * The Cortex-A7 minimum L1 D-line is 32 B; loop is conservative. */
   const uint32_t line_sz = 32U;
   if (clean_before) {
      for (uint32_t a = dst_addr & ~(line_sz - 1U);
           a < dst_addr + len; a += line_sz)
         L1C_CleanInvalidateDCacheMVA((void *)a);
      __asm volatile("dsb sy" ::: "memory");
   }

   /* Number of bytes per buffer transfer. Choose 64 B = 16 beats of
    * 32-bit (matches AXI/AHB max burst length on this CPU bus).  TLEN
    * field is "bytes-1".  Override with -DMDMA_TLEN=<N> to probe the
    * per-buffer-vs-per-byte overhead model. */
#ifndef MDMA_TLEN
#define MDMA_TLEN 64U
#endif
#ifndef MDMA_SBURST
#define MDMA_SBURST 0U
#endif
   const uint32_t tlen = MDMA_TLEN;
   const uint32_t bndt = len; /* block size in bytes */

