js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
   /* Block-repeat path requires 64 KiB-multiple lengths for >0x1FFFF.
    * Validate up front (matches the mem-mapped helper's check). */
   if (len > 0x1FFFFU && (len & 0xFFFFU))
      return HAL_ERROR;

   /* TRGM picks per-request granularity:
    *   small (<=TLEN)        -> 0 (one buffer per request)
    *   medium (<=64 KiB)     -> 1 (one block per request)
    *   large (block-repeat)  -> 2 (one repeated block == entire xfer)
    * Combined with SWRM=1, a single software trigger kicks the whole
    * transfer; subsequent beats are paced by AHB stall when the QSPI
    * FIFO is empty rather than by per-buffer FTF round-trips.  This
    * mirrors mdma_mm_to_dst() in cli.c. */
   uint32_t trgm;
   if (len <= tlen)
      trgm = 0U;
   else if (len <= 65536U)
      trgm = 1U;
   else
      trgm = 2U;

   /* CTCR:
    *   SINC = 0  (source address fixed, QUADSPI->DR)
    *   DINC = 2  (destination increments)
    *   SSIZE = 2 (32-bit reads from FIFO)
    *   DSIZE = 2 (32-bit writes to DDR)
    *   DINCOS = 2 (destination advances by 32-bit words)
    *   SBURST = 0 (single 32-bit read; QSPI FIFO is FTHRES=3 -> >=4 B)
    *   DBURST = 4 (16-beat burst write to DDR)
    *   TLEN  = tlen-1
    *   PKE = 0, PAM = 0 (matched sizes)
    *   TRGM = trgm (see above)
    *   SWRM = 1 (software request -- one SWRQ drains the whole block)
    *   BWM  = 1 (bufferable writes -- DDR is normal cacheable)
    */
   const uint32_t ctcr =
       (0U  << MDMA_CTCR_SINC_Pos)   |
       (2U  << MDMA_CTCR_DINC_Pos)   |
       (2U  << MDMA_CTCR_SSIZE_Pos)  |
       (2U  << MDMA_CTCR_DSIZE_Pos)  |
       (2U  << MDMA_CTCR_DINCOS_Pos) |
       (MDMA_SBURST << MDMA_CTCR_SBURST_Pos) |
       (4U  << MDMA_CTCR_DBURST_Pos) |
       ((tlen - 1U) << MDMA_CTCR_TLEN_Pos) |
       (trgm << MDMA_CTCR_TRGM_Pos)  |
       MDMA_CTCR_SWRM |
       MDMA_CTCR_BWM;

   /* CBNDTR.BNDT = block size in bytes (max 0x1FFFF = 128 KB - 1).
    * For multi-MB transfers, use block-repeat with 65536-byte blocks.
    * Source is fixed (QUADSPI->DR) so BRSUM=0; destination is contiguous
    * across blocks so BRDUM=1.  CBRUR stays 0 (no per-block address
    * offset). */
   if (len > 0x1FFFFU) {
      const uint32_t blocks = len >> 16; /* len / 65536 */
      if (blocks == 0U || blocks > 0xFFFU + 1U)
         return HAL_ERROR;
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos) |
                   MDMA_CBNDTR_BRDUM; /* dst increments across blocks */
      ch->CBRUR = 0U;
   } else {
      ch->CBNDTR = bndt & MDMA_CBNDTR_BNDT_Msk;
      ch->CBRUR  = 0U;
   }

   ch->CTCR = ctcr;
   ch->CSAR = (uint32_t)&QUADSPI->DR;
   ch->CDAR = dst_addr;
   /* CTBR.TSEL = 0x1A (QUADSPI FIFO threshold).  Unused in SWRM=1 mode
    * (the channel is driven by software request, not the QSPI FTF
    * line), but harmless to leave programmed.  SBUS/DBUS = 0 (AXI). */
   ch->CTBR = 0x1AU & MDMA_CTBR_TSEL_Msk;
   ch->CMAR = 0U;
   ch->CMDR = 0U;

   /* Build QUADSPI CCR (FMODE=01 indirect read).  Match the bench's
    * raw / non-raw layout. */
   QUADSPI->DLR = len - 1U;
   QUADSPI->ABR = 0U;

   uint32_t ccr = 0;
   if (!raw) {
      ccr |= ((uint32_t)opcode) << CCR_INSTRUCTION_Pos;
      ccr |= 1U << CCR_IMODE_Pos;
      ccr |= 1U << CCR_ADMODE_Pos;
      ccr |= (3U - 1U) << CCR_ADSIZE_Pos;
   }
   ccr |= lines_to_mode(data_lines) << CCR_DMODE_Pos;
   ccr |= (uint32_t)(dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)QSPI_FMODE_READ) << CCR_FMODE_Pos;

   /* DMAEN routes QSPI's FTF flag to the MDMA HW-request line; in SWRM=1
    * mode the MDMA ignores HW requests, so DMAEN is irrelevant.  Leave
    * it asserted -- the legacy per-buffer FTF arc is benign and keeps
    * any future TSEL-driven path consistent. */
   QUADSPI->CR |= QUADSPI_CR_DMAEN;

   /* Arm MDMA channel (no SWRQ yet) before kicking QSPI. */
   __asm volatile("dsb sy" ::: "memory");
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL;
   __asm volatile("dsb sy" ::: "memory");

   QUADSPI->CCR = ccr;
   if (!raw)
      QUADSPI->AR = 0U;

   /* Issue the software request: the channel pulls beats back-to-back,
    * AHB-stalled when the QSPI FIFO is empty rather than waiting for
    * per-buffer FTF round-trips. */
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL | MDMA_CCR_SWRQ;

   mdma_active_dst = dst_addr;
   mdma_active_len = len;
   mdma_active = true;
   return HAL_OK;
}

HAL_StatusTypeDef qspi_mdma_crc_start(uint8_t opcode,
                                      qspi_lines_t data_lines,
                                      uint8_t dummy_cycles,
                                      uint32_t len,
                                      bool raw,
                                      uint32_t crc_dr_addr,
                                      uint32_t timeout_ms)
{
   if (!initialised || len == 0U)
      return HAL_ERROR;
   if (mdma_active)
      return HAL_BUSY;

   __HAL_RCC_MDMA_CLK_ENABLE();

   const uint32_t deadline = HAL_GetTick() + timeout_ms;
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;

   uint32_t cr = QUADSPI->CR;
   cr &= ~QUADSPI_CR_FTHRES_Msk;
   cr |= ((data_lines == QSPI_LINES_4 ? 3U : 15U)
          << QUADSPI_CR_FTHRES_Pos);
   QUADSPI->CR = cr;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   const uint32_t tlen = 64U;
   ch->CTCR =
       (0U << MDMA_CTCR_SINC_Pos) |
       (0U << MDMA_CTCR_DINC_Pos) |
       (0U << MDMA_CTCR_SSIZE_Pos) |
       (0U << MDMA_CTCR_DSIZE_Pos) |
       (0U << MDMA_CTCR_SINCOS_Pos) |
       (0U << MDMA_CTCR_DINCOS_Pos) |
       (0U << MDMA_CTCR_SBURST_Pos) |
       (0U << MDMA_CTCR_DBURST_Pos) |
       ((tlen - 1U) << MDMA_CTCR_TLEN_Pos);

